/*
L1-008 求整数段和（10 分）
给定两个整数A和B，输出从A到B的所有整数以及这些数的和。
输入格式：
输入在一行中给出2个整数A和B，其中-100<=A<=B<=100，其间以空格分隔。
输出格式：
首先顺序输出从A到B的所有整数，每5个数字占一行，每个数字占5个字符宽度，向右对齐。
最后在一行中输出全部数字的和。
输入样例：
-3 8
输出样例：
   -3   -2   -1    0    1
    2    3    4    5    6
    7    8
Sum = 30
*/
#include <stdio.h>

int main()
{
    int A, B;
    int sum=0, num=1;
    scanf("%d %d", &A, &B);

	if (B<A) {
		return 0;
	}
    for( ;A<=B; A++) {
        printf("%5d", A);
        sum+=A;
        if (num++%5==0) {
        	printf("\n");
		}
    }
    if ((num-1)%5 != 0) {	// 当数据只有5个的时候，上面已经有一个换行，减出那个换行 
		printf("\n");
	}
	printf("Sum = %d", sum);
    
    return 0;
}
